//
// Created by Psy.C on 2025/11/24.
//

IDENTIFICATION DIVISION.
PROGRAM-ID. A-PLUS-B.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 A PIC 9(5).
01 B PIC 9(5).
01 RESULT PIC 9(6).

PROCEDURE DIVISION.
    ACCEPT A
    ACCEPT B
    COMPUTE RESULT = A + B
    DISPLAY RESULT
    STOP RUN.