//
// Created by Psy.C on 2026/1/17.
//
/*
 *m[0], m[1], m[2], m[3], m[4] 分别记录数字0,1,2,3,4的出现次数
 *
 *如果数字1的数量大于等于数字2的数量
 *从数字1的计数中减去数字2的数量
 *将数字2的数量加到数字3的计数中
 *答案加上数字2的数量
 *将数字2的计数设为0
 *
 *将数字1的完整三元组数量加到数字3的计数中
 *答案加上每组三个1能产生的结果(每组产生2个)
 *保留数字1的余数部分
 *如果剩余的1不超过3的数量，全部计入答案
 *如果有4且还剩2个1，加2
 *如果至少有2个4且还剩1个1，加2
 *否则无解
 *
 *如果数字1的数量小于数字2的数量
 *从数字2的计数中减去数字1的数量
 *将数字1的数量加到数字3的计数中
 *答案加上数字1的数量
 *将数字1的计数设为0
 *将数字2的完整三元组数量的2倍加到数字3的计数中
 *答案加上每组三个2能产生的结果
 *保留数字2的余数部分
 *如果还剩1个数字2
 *如果有数字4，加1
 *如果至少有2个数字3，加2
 *否则无解
 *如果还剩2个数字2，加2
 *
 */
#include <iostream>
#define fast ios_base::sync_with_stdio(0), cin.tie(0), cout.tie(0)
using namespace std;


int main() {
    fast;
    int n; cin >> n;
    int m[5]={};
    while (n--) {
        int a; cin >> a;
        m[a]++;//将对应数字的计数增加1
    }
    int ans = 0;
    if (m[1] >= m[2]) {
        m[1] -= m[2], m[3] += m[2], ans += m[2], m[2] = 0;
        m[3] += m[1] / 3, ans += m[1] / 3 * 2, m[1] %= 3;
        if (m[1] <= m[3]) ans += m[1];
        else if (m[4] && m[1] == 2) ans += 2;
        else if (m[4] >= 2 && m[1] == 1) ans += 2;
        else ans = -1;
    } else {
        m[2] -= m[1], m[3] += m[1], ans += m[1], m[1] = 0;
        m[3] += m[2] / 3 * 2, ans += m[2] / 3 * 2, m[2] %= 3;
        if (m[2] == 1) {
            if (m[4]) ans++;
            else if (m[3] >= 2) ans += 2;
            else ans = -1;
        } else if (m[2] == 2) ans += 2;
    }
    cout << ans << '\n';
    return 0;
}