//
// Created by Psy.C on 2026/3/29.
//
/**
1. 先减去被单个素数整除的数
x/2: 被2整除的数个数
x/3: 被3整除的数个数
x/5: 被5整除的数个数
x/7: 被7整除的数个数
2. 加回被两个素数同时整除的数（因为被减了两次）
x/6: 被2和3整除的数个数（即被6整除）= x/2*3
x/10: 被2和5整除的数个数（即被10整除）= x/2*5
x/14: 被2和7整除的数个数（即被14整除）= x/2*7
x/15: 被3和5整除的数个数（即被15整除）= x/3*5
x/21: 被3和7整除的数个数（即被21整除）= x/3*7
x/35: 被5和7整除的数个数（即被35整除）= x/5*7
3. 减去被三个素数同时整除的数（因为被多加了一次）
x/30: 被2、3、5整除的数个数（即被30整除）= x/2*3*5
x/70: 被2、5、7整除的数个数（即被70整除）= x/2*5*7
x/42: 被2、3、7整除的数个数（即被42整除）= x/2*3*7
x/105: 被3、5、7整除的数个数（即被105整除）= x/3*5*7
4. 加回被四个素数同时整除的数（因为被多减了一次）
x/210: 被2、3、5、7整除的数个数（即被210整除）= x/2*3*5*7
 */
#include <bits/stdc++.h>
#define fast ios_base::sync_with_stdio(0), cin.tie(0), cout.tie(0)
#define ll long long
using namespace std;

ll x;
int main() {
    fast;
    cin >> x;
    cout << x-x/2-x/3-x/5-x/7+x/6+x/10+x/14+x/15+x/21+x/35-x/30-x/70-x/42-x/105+x/210;
    return 0;
}