//
// Created by Psy.C on 2025/9/25.
//
/*
*如果相邻两个数a[j]和a[j+1]都是偶数，则不断执行：
输出"/j"表示将这两个数都除以2
将a[j]和a[j+1]都除以2
这个过程会持续到至少有一个数变成奇数为止
 *
*如果所有4个数都是奇数：
如果都是1，则返回结束
否则输出"+1"和"+3"，然后将所有数都加1
 *
*否则如果a[1]和a[3]都是奇数：
输出"+1"和"+2"
a[1]和a[3]加1，a[2]加2
 *
*如果a[2]和a[4]都是奇数：
输出"+2"和"+3"
a[2]和a[4]加1，a[3]加2
 *
*如果a[2]和a[3]都是奇数：
输出"+2"
a[2]和a[3]都加1
 *
 *
 *
 */
#include <ios>
#include <iostream>
using namespace std;


void solve() {
    int a[5];
    cin >> a[1] >> a[2] >> a[3] >> a[4];
    for (int i = 1; i <= 200; ++i) {
        for (int j = 1; j <= 3; ++j) {
            while (a[j] % 2 == 0 && a[j + 1] % 2 == 0) {
                cout << "/" << j << "\n";
                a[j] /= 2;
                a[j + 1] /= 2;
            }
        }
        if (a[1] % 2 == 1 && a[2] % 2 == 1 &&
            a[3] % 2 == 1 && a[4] % 2 == 1) {
            if (a[1] == 1 && a[2] == 1 &&
                a[3] == 1 && a[4] == 1) return;
            cout << "+1" << "\n";
            cout << "+3" << "\n";
            a[1]++;a[2]++;a[3]++;a[4]++;
        } else if (a[1] % 2 == 1 && a[3] % 2 == 1) {
            cout << "+1" << "\n";
            cout << "+2" << "\n";
            a[1]++;a[3]++;a[2]+=2;
        }
        if (a[2] % 2 == 1 && a[4] % 2 == 1) {
            cout << "+2" << "\n";
            cout << "+3" << "\n";
            a[2]++;a[4]++;a[3]+=2;
        }
        if (a[2] % 2 == 1 && a[3] % 2 == 1) {
            cout << "+2" << "\n";
            a[2]++;a[3]++;
        }
    }
}

int main() {

    ios_base::sync_with_stdio(false); cin.tie(nullptr); cout.tie(nullptr);

    int t(1);
    while (t--) solve();
    return 0;
}